[
  {
    "path": "posts/2022-01-23-creating-a-pareto-chart-using-ggplot/",
    "title": "Creating a Pareto Chart using ggplot",
    "description": "This post aims to share with you how to create a pareto chart by using ggplot package of R.",
    "author": [
      {
        "name": "Dr. KAM Tin Seong, <br>Associate Professor of Information Systems (Practice)",
        "url": "https://www.smu.edu.sg/faculty/profile/9618/KAM-Tin-Seong"
      }
    ],
    "date": "2022-01-23",
    "categories": [],
    "contents": "\r\nOverview\r\nPareto chart is a popular data visualisation use to reveal something like the 80-20 rule. \r\nThe purpose of the Pareto chart is to highlight the most important among a (typically large) set of factors. In market share study, Pareto charts are useful to reveal if the business is dominated by a handful of key products or customers. In general, businesses will try to avoid their businesses over-dependent by a few products or customers because if something happen to their key products or business partners, the businesses will be very badly affected.\r\nIn the nutshell, a Pareto chart is a dual axis chart. The y-axis on the left (also known as primary y-axis) shows the absolute frequency of the observations and their values are presented as bars. The y-axis on the right shows the cumulative frequency of the observed values and they are presented as dots. These dots are then joined by a smooth line.\r\nThe Task\r\nIn this exercise, we are going to create a pareto chart showing the distribution of returns by product sub-category by using a data set from a retail store group.\r\nGetting started\r\nInstalling and loading the required libraries\r\nFigure below shows the workflow of a typical data science and analytics process and the tidyverse R packages that specially designed to support the specific tasks in the data science and analytics process.\r\n\r\nBefore we get started, it is important for us to ensure that the required R packages have been installed. For the purpose of the exercise, the follow tidyverse packages will be used:\r\nreaxl package will be used to read and parse a worksheet into R as a tibble data frame format. (It is important to note that the R object is in tibble data frame and not the generic data frame).\r\ndplyr package will be used to perform data transformation and data wrangling tasks\r\nggplot2 package will be used to building the pareto chart by using the principle of Layered Grammar of Graphs.\r\n\r\nThe code chunk below is used to check if the necessary R packages are installed in R. If they have yet, then RStudio will install the missing R package(s). If are already been installed, then they will be launch in R environment.\r\n\r\n\r\npackages = c('tidyverse', 'readxl', 'knitr')\r\n\r\nfor(p in packages){\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\nIt is important note that readxl package has to be listed separately in the packages list because it is not part of the core tidyverse package.\r\nData Import\r\nIn this exercise, superstore-2021 data set will be used in this example. It is an MS Excel workbook. It consists of three worksheets, namely: Orders, People and Returns.\r\nThe code chunk below imports superstore-2021.xls into R environment by using read_csv() function of readr package.\r\n\r\n\r\norders <- read_xls(\"data/Superstore-2021.xls\",\r\n                  sheet = \"Orders\")\r\nreturns <- read_xls(\"data/Superstore-2021.xls\",\r\n                  sheet = \"Returns\")\r\n\r\n\r\n\r\nAfter parsing the worksheet into R, it is a good practice to check the structure and content of the newly tibble data frames in RStudio.\r\nData Wrangling\r\nJoining the two data frames\r\nIn this step, the left_join() of dplyr is used to join the returns data frame and orders data frame by using Order ID as the unique identifier.\r\n\r\n\r\njoined_tab <- left_join(returns, orders,\r\n                        by = c('Order ID' = 'Order ID'))\r\n\r\n\r\n\r\nTo learn more about Join of dplyr, click on this link.\r\nCompute the frequency count by Sub-Category\r\nNext, we are going to compute the frequency count of returns by sub-category. There are two ways to complete the task. The first way is by using the group-by method and the second way is by using the count method of dplyr.\r\nThe group-by method\r\nIn the code chunk below, group_by() of dplyr package is used to group the orders by Sub-Category. Then, summarise() of dplyr is used to count (i.e. n()) the number of returned orders.\r\n\r\n\r\nfreq_returned <- joined_tab %>%\r\n  group_by(`Sub-Category`) %>%\r\n  summarise('Returns' = n()) %>%\r\n  ungroup()\r\n\r\n\r\n\r\n]\r\nThe count method\r\nThe code chunk below shows the alternative way to derive the frequency of returns by sub-category. In this case, count() of dplyr package is used.\r\n\r\n\r\nfreq_returned <- joined_tab %>% \r\n  count(`Sub-Category`) %>%\r\n  rename(Returns = n)\r\n\r\n\r\n\r\n]\r\nBy default, count() will return a new field called n to store the result. In view of this, rename() of dplyr is used to rename n to Returns.\r\nSorting data\r\nBy default, the values of the tibble data frame is sorted according to the values of the first column. In this case, the values are sorted alphabetically by Sub-Category field as shown in the figure below\r\n\r\nBefore we can compute the cumulative frequency, we need to sort the values in the sub-category field by the values in the Returns field. To accomplish this task, the arrange() of dplyr package is used as shown in the code chunk below.\r\n\r\n\r\nfreq_sorted <- freq_returned %>%\r\n  arrange(desc(Returns))\r\n\r\n\r\n\r\nThe sorted data frame should look similar to the screenshot below.\r\n\r\nComputing the cumulative frequency\r\nOut next task is to compute the cumulative frequency of returns by product sub-category. This task will be performed by using mutate() of dplyr package and cumsum() of Base R.\r\n\r\n\r\nfreq_cum <- freq_sorted %>%\r\n  mutate(cumfreq = cumsum(Returns))\r\n\r\n\r\n\r\nThe newly computed cumulative frequency values will be stored in a new field called cumfreq as shown in the screenshot below.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-01-23T11:05:41+08:00",
    "input_file": "creating-a-pareto-chart-using-ggplot.knit.md"
  },
  {
    "path": "posts/2021-06-17-parsing-text-using-r/",
    "title": "Parsing Text using R",
    "description": "This post aims to share with you how to import a text document into R and at the same time extracting each row into column of a data.frame.",
    "author": [
      {
        "name": "Dr. KAM Tin Seong, <br>Associate Professor of Information Systems (Practice)",
        "url": "https://www.smu.edu.sg/faculty/profile/9618/KAM-Tin-Seong"
      }
    ],
    "date": "2021-06-17",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nGetting Started\r\nInstalling and launching R Packages\r\nTidying the text document\r\n\r\nReading a text file into R\r\nConverting each element of the list into a data.frame\r\nBinding these into a single data frame\r\nSpliting the rawdata column\r\nTransposing from ‘long’ to ‘wide’ format\r\n\r\nIntroduction\r\nThis post aims to share with you how to import a text document into R and at the same time extracting each row into column of a data.frame.\r\nScreenshot below show how the original text document look like.\r\n\r\nIn this post, we are going to learn how to extract the text and capture them into columns look similar to the screenshot below\r\n\r\nGetting Started\r\nInstalling and launching R Packages\r\nTwo R packages from the tidyverse family will be used to accomplish the task, they are: stringr and tidyr.\r\nThe code chunk below will be used install and launch the packages in RStudio.\r\n\r\n\r\npackages = c('stringr', 'tidyr')\r\nfor (p in packages){\r\nif(!require(p, character.only = T)){\r\ninstall.packages(p)\r\n}\r\nlibrary(p,character.only = T)\r\n}\r\n\r\n\r\n\r\nTidying the text document\r\nBefore getting start, it will be wiser to tidy the text document as shown below\r\n\r\nThe main changes are as follows:\r\nRemove all the empty lines between two sentences.\r\nAdd “AUTHOR:” in front of the author name.\r\nKeep author name as a separated line.\r\nFor Text: line, edit the multiple sentences into a single paragraph.\r\nNow, we are ready to import the text file into R.\r\nReading a text file into R\r\nFirst, lapply() of Base R is used to import the text document (i.e. 77.txt) into R as a list object called textlist.\r\n\r\n\r\ntextlist <- lapply(\"data/77.txt\", readLines)\r\n\r\n\r\n\r\nThe code chunk below can be used to check the newly created object.\r\n\r\n\r\ntextlist\r\n\r\n\r\n[[1]]\r\n[1] \"SOURCE: All News Today\"                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         \r\n[2] \"TITLE: A LOOK BACK AT A LIFE CUT TRAGICAL SHORT\"                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                \r\n[3] \"AUTHOR: ELIAN KAREL \"                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           \r\n[4] \"PUBLISHED: 2011/06/21\"                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          \r\n[5] \"LOCATION: ABILA, Kronos\"                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \r\n[6] \"TEXT: Two years ago yesterday Elian Karel died at age 28 in an Abila jail cell, purportedly of cardiac arrest.  Kraft had reached an agreement with the government that charges would be reduced and the Karel be released pending a trial, but Karel died two days before he was to go free. Questions linger, however, about the manner of Karel's death.  Requests for information were met with assurances that the police,  whose custody Karel was in at the time of his death, would do everything possible to perform an exhaustive investigation.  After Karel's body was cremated and sent to his family in Elodis, the Abila Chief of Police closed the case and has declined to answer questions about Karel's death stating that \\\"we are satisfied the death was of natural causes and will no longer be entertaining inquiries.\\\" As reported at the time of Karel's death, several people close to the investigation reported that Karel's body showed signs of blunt force trauma, abrasions and lacerations which were not consistent with the cause of death reported by the police. Police have denied anything unusual happened in Karel's death and city officials claim the accusations of murder and wrongful death are asserted by POK rabble-rousers attempting to incite instability and violence. Yesterday on the morning of June 19th, a small group of POK supporters gathered in front of the Abila Police Station, holding photographs of Elian, and of another young martyr, Juliana Vann, the ten-year old girl who died in 1998 from cancer caused by benzene toxins in her drinking water. \\\"Both of them died because of government lies and corruption,\\\" one man told me who asked that his name be withheld because of concerns of police retaliation.  \\\"Juliana died because Kronos allowed GAStech to poison our water, and Elian died because he tried to bring Juliana justice.\\\"\"\r\n\r\nConverting each element of the list into a data.frame\r\nThe code chunk below is used to convert each element in the newly created list into data.frame. The output will replaced the initial textlist object.\r\n\r\n\r\ntextlist <- lapply(1:length(textlist),\r\n                   function(i) data.frame(\r\n                          caseno=i,\r\n                          rawdata=textlist[[i]],\r\n                          stringsAsFactors = FALSE))\r\n\r\n\r\n\r\nYou can examine the structure of textlist object by click on it’s name on the Data display panel.\r\n\r\nNotice that the object is a data.frame consisting 2 columns and 6 rows as shown in the figure below.\r\n\r\nBinding these into a single data frame\r\nThe code chunk below will be used to bind the list object into a data.frame.\r\n\r\n\r\ndf <- do.call(rbind, textlist)\r\n\r\n\r\n\r\nSpliting the rawdata column\r\nThe code chunk below is then used to split the rawdata column into two columns at the first ‘:’. Two functions of stringr package, namely: str_trim() and str_split_fixed() are used to complete the task.\r\n\r\n\r\ndf[,c(\"type\",\"entry\")] <- str_trim(str_split_fixed(df$rawdata,\":\",2))\r\n\r\n\r\n\r\nNotice that the newly created two columns are called type and entry as shown in the screenshot below\r\n\r\nTransposing from ‘long’ to ‘wide’ format\r\nLastly, the pivot_wider() of tidyr package will be used to transpose the two columns into multiple columns data.frame as shown in the screenshot below.\r\n\r\n\r\ndf <- df[,c(\"caseno\",\"type\",\"entry\")]\r\ndf <- pivot_wider(df,\r\n                  names_from = type,\r\n                  values_from = entry)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-17T15:47:59+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-23-git-token/",
    "title": "Solving git(GitHub) token issue",
    "description": "In this tutorial, you will learn how to manage git and gitHub credential issue when you need to connect a local repo with GitHub.",
    "author": [
      {
        "name": "Dr. KAM Tin Seong, <br>Associate Professor of Information Systems (Practice)",
        "url": "https://www.smu.edu.sg/faculty/profile/9618/KAM-Tin-Seong"
      }
    ],
    "date": "2021-05-23",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nMotivation\r\nGetting Started\r\nChecking the Credential\r\nUsing gh_whoami()\r\nUsing git_sitrep()\r\n\r\nGet a personal access token (PAT)\r\nPut the PAT into the Git credential store\r\nReferences\r\n\r\nMotivation\r\nWhen running usethis::use_github() command in RStudio, you encountered error message as shown below.\r\n\r\nAs a result, you are not able to pull or push changes made to github repository.\r\nGetting Started\r\nBefore you can fix the issue, you must have gh and gitcreds packages installed. gh package minimalistic client to access GitHub’s REST and GraphQL APIs. gitcreds package, on the other hand, prvodies functions to query git credentials from R.\r\nNote: You will have the gitcreds and gh packages installed, as of usethis v2.0.0, because usethis uses gh, and gh uses gitcreds.\r\nChecking the Credential\r\nThere are two ways to check for PAT is already provided in your machine. The first method is by using gh_whoami() of gh package. Alternatively, git_sitrep() of usethis package can be used too.\r\nUsing gh_whoami()\r\nAt RStudio Console, type the command below and press Enter key.\r\n\r\n\r\ngh::gh_whoami()\r\n\r\n\r\n\r\nIf you already have a PAT, your Console window should look similar to the screenshot below.\r\n\r\nIn this case, you do not have to continue the remaining steps.\r\nIf no PAT information are revealed, you will move on to next step to put your PAT into the Git credential store.\r\nUsing git_sitrep()\r\nAt RStudio Console, type the command below and press Enter key.\r\n\r\n\r\nusethis::git_sitrep()\r\n\r\n\r\n\r\nIf you already have a PAT, your Console window should look similar to the screenshot below.\r\n\r\nNote: The above is an subset of the complete list display on the screen.\r\nGet a personal access token (PAT)\r\nAfter checking the PAT information in your machine, you are ready to fix the problem.\r\nFirstly, we need to get a PAT by typing the command below on RStudio Console followed by pressing the Enter key.\r\n\r\n\r\nusethis::create_github_token()\r\n\r\n\r\n\r\nAssuming you’re signed into GitHub, create_github_token() takes you to a pre-filled form to create a new PAT.\r\nScroll all the way down the page and click on Generate token button.\r\nCopy the PAT to the clipboard (i.e. Ctrl-C).\r\nIt is a good practice to store the PAT in a file.\r\nPut the PAT into the Git credential store\r\nBefore we move on, we assume that you have the PAT available on the clipboard of your computer.\r\nAt RStudio Console, type the command below.\r\n\r\n\r\ngitcreds::gitcreds_set()\r\n\r\n\r\n\r\nIf you don’t have a PAT stored already, it will prompt you to enter your PAT.\r\nPaste the PAT on it (i.e. Ctrol-V).\r\nIf you do already have a stored credential, gitcreds::gitcreds_set() reveals this and will even let you inspect it as shown in the screenshot below.\r\n\r\nThis helps you decide whether to keep the existing credential or replace it. When in doubt, embrace a new, known-to-be-good credential over an old one, of uncertain origins.\r\nTo confirm if the PAT have been stored correctly in your machine, you can repeat the step given on Checking the Credential section of this tutorial.\r\nReferences\r\nManaging Personal Access Tokens of gh package.\r\nManaging Git(Hub) Credentials of usethis package.\r\nChapter 10 Cache credentials for HTTPS of Happy Git and GitHub for the useR\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-25T14:15:18+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-22-git-in-rstudio/",
    "title": "git in RStudio",
    "description": "This tutorial aims to provide you with the step-by-step guide on how to setup Git with R and RStudio.",
    "author": [
      {
        "name": "Dr. KAM Tin Seong, <br>Associate Professor of Information Systems (Practice)",
        "url": "https://www.smu.edu.sg/faculty/profile/9618/KAM-Tin-Seong"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nInstalling Git\r\nSetup Git in RStudio\r\nConfigure Git\r\nReference\r\n\r\nInstalling Git\r\nTo get started, you need to install Git in your computer. Additionally you will also need a GitHub account.\r\nDownload Git by using this link.\r\nInstalling Git. Note: It is important to provide the install Administrator right when installing Git.\r\nOn GitHub create yourself a free GitHub account.\r\nSetup Git in RStudio\r\nThis step aims to tell RStudio where to find the Git installation.\r\nOpen RStudio and go to Tools -> Global Options…, click on Git/SVN.\r\nYour screen should look similar to the screenshot below.\r\n\r\nIf there is not setting or the setting is at the wrong path,\r\nclick on the Browse button behind Git executable:.\r\nNavigate to the correct folder where Git is installed. In general the path should be C:/Program Files/Git/bin/git.exe on 64bit machine on Windows OS.\r\nClick on the Apply button to confirm the changes.\r\nClick on OK button to close the window.\r\nRestart RStudio, if it worked out you will find the Git icon on the top toolbar, as shown below.\r\n\r\nConfigure Git\r\nIn this step, you will configure Git and set your user name and email (the email address you used to register on GitHub). You can directly open the Git prompt from within RStudio.\r\nNote: User name and email needs to be set only once.\r\nGo to Tools -> Shell to open the Git Shell.\r\nAt the Shell command window, type the following commands.\r\n\r\nNote: the user.name should be the user name on Github and the user.email should be the email address you used to create Github account.\r\nClose Shell window.\r\nReference\r\nIf you are new to Git and Github, this link provides a lot of useful resources.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T09:41:47+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-01-06-building-a-website-with-distall-for-rmarkdown/",
    "title": "Building a website with distall for RMarkdown",
    "description": "This tutorial aims to provide you a step-by-step guide to build a web blog by using distill for R Markdown package.",
    "author": [
      {
        "name": "Dr. KAM Tin Seong, <br>Associate Professor of Information Systems (Practice)",
        "url": "https://www.smu.edu.sg/faculty/profile/9618/KAM-Tin-Seong"
      }
    ],
    "date": "2021-01-06",
    "categories": [],
    "contents": "\r\nGetting Started\r\nInstalling distill\r\nBefore you getting started, you need to install distill.\r\nStart RStudio\r\nAt the Console window of RStudio, type the code chunk below:\r\n\r\n\r\ninstall.packages(\"distill\")\r\n\r\n\r\n\r\nTo learn more about what functions and features offer by distill, you should visit the homepage of distill for R Markdown at least once. The homepage provides a comprehensive discussion on the features and functions of distill.\r\nOpening github and Netlify accounts\r\nIn this tutorial, github will be used to host the blog post and will be deploy via Netlify. To create an account, please visit their respective homepage below:\r\ngihtub\r\nnetlify\r\nStart a New Website Project\r\nTo start a new website project,\r\nFrom the menu bar of RStudio, click on File -> New Project.\r\n\r\nThe New Project Wizard appears.\r\n\r\nClick on New Directory -> Distill Website.\r\n\r\nYour screen should look similar to the screenshot below.\r\n\r\nFor Directory name:, type a name such as DA. Avoid long name or/and name with spaces in between.\r\nFor Create project as subdirectory of:, navigate to a folder in your harddisk.\r\nFor Title:, provide a proper title for your blog (i.e. Data Analytics Journey).\r\nClick on Create Project when you are ready.\r\nLet us examine the Files window of RStudio as shown in the screenshot below. The home-directory is called DA. It consists of the DA.rproj file, the about.rmd file, the index.rmd file, the *_site.yml* file and *_site. The _site* folder contains all the final html files and other libraries required to build the web page.\r\n\r\nViewing the newly created blog page\r\nNext, let us view the newly created blog page.\r\nClick on *_site* folder.\r\nClick on index.html.\r\nSelect View in Web Browser from the context menu\r\nA web page appears on RStudio viewer as shown below.\r\n\r\nCongratulations! Your first web blog has been built successfully.\r\nEditing the _site.yml Page\r\nFrom RStudio window, click on _site.yml tab.\r\nYou screen should look similar to the screenshot below.\r\n\r\nThe _site.yml is where we control the content of the blog that include the name, title, descriptive, and the navigation bars.\r\nWe will add two new navigation bars on the left. One for DataViz Makeover and one of Take-home Exercise.\r\nInsert line 12-19 as shown in the screenshot below.\r\n\r\nClick on the Save icon to save the change.\r\nTo update the change, you can either\r\nClick on index.rmd and then click on Knit icon.\r\nAlternatively, the code chunk below should be used.\r\n\r\n\r\nrmarkdown::render_site()\r\n\r\n\r\n\r\nNote: It is important to perform either one of the above step when *_site.yml* is edited.\r\nNotice that two new navigation bars are added on the website.\r\n\r\nEditing about.rmd\r\nIn this section, you will learn how to edit the about.rmd file and update its corresponding html page.\r\nFrom RStudio window, click on about.rmd tab.\r\nYour screen will look similar to the screenshot below.\r\n\r\nThis is the default about page. Let us edit the about.rmd similar to the screenshot below.\r\n\r\nKnit the document when the editing is completed.\r\nThe About page of the blog will look similar to the screenshot below.\r\n\r\nStarting Git\r\nIn this section, you will learn how to start a git service in RStudio by using use_git() of usethis package.\r\n Note: Use the code chunk below to install usethis if it has yet to be installed in your computer.\r\n\r\n\r\ninstall.packages(\"usethis\")\r\n\r\n\r\n\r\nNext, you will edit the code chunk below on RStudio Console.\r\n\r\n\r\nusethis::use_git()\r\n\r\n\r\n\r\nPress on Enter or Return key.\r\nThe follow message appears.\r\n\r\nAt this stage, we are not ready to commit the edition.\r\nFor Selection:, type 3.\r\nPress on Enter key.\r\nThe follow message appears.\r\n\r\nWe are going to re-start RStudio.\r\nFor Selection:, type 1.\r\nPress on Enter key.\r\nThe Switch Projects dialog window appears.\r\n\r\nClick on Save button.\r\nNotice that Git tab has been added on RStudio pane.\r\n\r\nYour screen should look similar to the screenshot below.\r\n\r\nWe are going to commit all changes.\r\nClick on the checkboxes in front of all the files.\r\nYour screen should look similar to the screenshot below.\r\n\r\nClick on Commit button.\r\nNotice that we can not push the commit because we have yet to configured Github.\r\nConfiguring and Pushing to Github\r\nIn this section, you will learn how to configure Github and push the commit to Github.\r\nAt RStudio Console, type the command below:\r\n\r\n\r\nusethis::use_github()\r\n\r\n\r\n\r\nPress on Enter key to run the command.\r\nOnce the operation completed, the Gihtub webpage appears.\r\n\r\nPublishing the Blog\r\nIn this section, you will learn how to publish the newly create blog on Netlify server.\r\nNote: This sectgion assume that you have already create an account wit Netlify.\r\nLogin Netlify.\r\nYour screen should look similar to the screenshot below.\r\n\r\nClick on the button of New site from Git.\r\nYour screen should look similar to the screenshot below.\r\n\r\nClick on Github button.\r\nYour screen should look similar to the screenshot below.\r\n\r\nScrolling down until Publish Directory appears.\r\n\r\nAt Publish directory, type -site.\r\nWhen you are ready,\r\nClick on Deploy site button.\r\nNotice that Netlify will give a temporary and yet weird name.\r\n\r\nYou can change the name by using the Site settings option.\r\nClick on Site settings button.\r\nYour screen should look similar to the screenshot below.\r\n\r\nClick on Change site name button.\r\nThe Change site name dialog window appears.\r\n\r\nGive the site an easy to remember name (i.e r4dsa).\r\nClick on Save button.\r\nNotice that the blog page has a new name (i.e. r4dsa) now.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-01-06T16:35:20+08:00",
    "input_file": "building-a-website-with-distall-for-rmarkdown.knit.md"
  }
]
